[{"_id":{"$oid":"595cadfc51d94c1b707307a9"},"title":"espresso","ingredients":[{"name":"ground coffee"},{"name":"hot water"}],"description":"Concentrated beverage brewed by forcing nearly boiling water under pressure with ground coffee. Espresso has more caffeine per unit volume than most beverages.\n\nThe word \"shot\" is most commonly used as the basic unit of measurement in cafes and restaurants. People use the term \"shot of espresso\". A solo shot is usually 1 ounce of espresso. Likewise, doppio is most often used for a double shot, and triplo for a triple shot.\nA professional operator of an espresso machine is called a barista, which is Italian for bartender.","perfect_pull":"Freshness: Freshly roasted coffee beans (i.e. within 4 days of being roasted) will create more bubbles when pulling a shot. This makes a shot run slower when pulled causing less taste. Old roasted beans (i.e. after 14 days of being roasted) will taste flat with less aroma. The optimal range for most espresso shots is 1 to 2 weeks after being roasted.\n\nSpeed: If you notice that your shot speeds vary dramatically from one shot to another, it may be a sign of inconsistent doses. Check to make sure you use the same amount of grounded coffee beans for each shot for a more consistent speed.\n\n\n    Taste: If you notice that even with proper speed and amount your shots are tasting bad, it may be a good sign to clean your machine.","variation":"Dose: The amount of coffee used for a shot of espresso. An example for a single shot is 18g.\n\nTime: The time it takes to pull a shot of espresso is usually 20-30 seconds long.\n\nGrind: Having your grinds too long may result in longer extraction time. Having your grinds too coarse or a low dose may result in shorter extraction time.\n\nPulling: Action of making a shot of espresso","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243901/espresso_ke4gmd.png"},{"_id":{"$oid":"595cadfc51d94c1b707307aa"},"title":"americano","ingredients":[{"name":"espresso","amount":"1/3"},{"name":"hot water","amount":"2/3"}],"description":"An Americano is a drink with hot water added to espresso on the bottom. The hot water's purpose is to add volume to the drink. The taste is typically very similar to drinking pure espresso shots but gives more sips in every cup.\n\nThe name of this drink originates from an insult to Americans who weren't accustomed to drinking just pure shots of espresso. In Europe, coffee is essentially espresso. Note here that adding espresso to water (where espresso is on the top) refers to another drink called a long black.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243900/americano_nntean.png"},{"_id":{"$oid":"595cadfc51d94c1b707307ab"},"title":"latte","ingredients":[{"name":"espresso","amount":"1/4"},{"name":"steamed milk","amount":"3/4"},{"name":"microfoam","amount":"*"}],"description":"A latte is a drink with espresso on the bottom with steamed milk added to the top. The ratio is usually three to one. The latte is a classic and should be tried at any coffee shop. The reason there is sometimes a thin layer of microfoam on top is that microfoam sits on the bottom of the jug carrying the steamed milk when the barista froths it. As a result of usually pouring all or most of the jug, a thin layer of foam sits on top. Many trained and skilled baristas can create stunning artwork with this foam; You may have seen them already in many of your friend's pictures.","variation":"Mocha - made by adding chocolate syrup or hot chocolate on top of a latte.\n\nVanilla Latte - made by adding vanilla syrup on top of a latte. There are tons of variants where the only difference is the type of layer added on top of the latte. You can add caramel, hazelnut, etc.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243902/latte_q7jpnn.png"},{"_id":{"$oid":"595cb5722b189c1effe970dc"},"title":"mocha","ingredients":[{"name":"espresso","amount":"1/3"},{"name":"steamed milk","amount":"2/3"},{"name":"chocolate","amount":"*"}],"description":"A mocha is a drink with espresso with steamed milk and bittersweet mocha syrup on top. Most places also top it with whipped cream. You can think of it as essentially a latte with added layer of chocolate syrup or cocoa powder.","perfect_pull":null,"variation":"White mocha - made with white chocolate instead of milk or dark chocolate.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243902/mocha_wng3vz.png"},{"_id":{"$oid":"595cb5722b189c1effe970dd"},"title":"cappuccino","ingredients":[{"name":"espresso","amount":"1/3"},{"name":"steamed milk","amount":"1/3"},{"name":"microfoam","amount":"1/3"}],"description":"Espresso with steamed milk, then topped with a layer of micro-foamed milk. The texture of the drink is completely different than a latte as the milk foam is very velvety and foamy. When a barista steams the milk used in a cappuccino, the micro-foam is created by exposing air into the milk, which creates very tiny bubbles.","variation":"Iced cappuccino - the cold version of the cappuccino","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243900/cappuccino_u1z3tz.png"},{"_id":{"$oid":"595cb5722b189c1effe970de"},"title":"espresso macchiato","ingredients":[{"name":"espresso","amount":"4/5"},{"name":"microfoam","amount":"1/5"}],"description":"This drink consists of espresso topped with a small amount of milk foam. Macchiato is Italian for \"marked\" or \"stained\", where the mark is referring to the milk in this case. So essentially the espresso is \"marked\" with the milk. The small amount of milk here is key. When you order one, you will notice that the total volume of the drink is less than a latte. Many people confuse this drink with \"latte macchiato\" which is probably the drink people are more familiar with.\n\nThe reason for this drink is because baristas had to show serving waiters the difference between an espresso and an espresso with a tiny amount of milk in it.","variation":"Caffé macchiato - same drink but just another name for it.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243901/espresso_macchiato_fxp6ux.png"},{"_id":{"$oid":"595cbb55b6fbc921d892949c"},"title":"latte macchiato","ingredients":[{"name":"steamed milk","amount":"3/8"},{"name":"espresso","amount":"1/8"},{"name":"microfoam","amount":"1/2"}],"description":"The drink is made up of espresso added on top of the milk rather than the milk to espresso. The \"mark\" here refers to the milk instead of the espresso. Be careful when ordering a drink with the name macchiato. Make sure it is the type you want. When drinking this, you will notice that the drink first starts off bitter because the espresso is on top. As you keep sipping, you will notice the drink will get sweeter because of the steamed milk that awaits.\n\nMany people actually do not know the difference between an espresso macchiato and a latte macchiato.","variation":"Caramel macchiato - just add a caramel syrup on top of this drink. Similarly, you can add chocolate, vanilla, or any other sweet syrup.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499249265/latte_macchiato_xfwamv.png"},{"_id":{"$oid":"595cbb55b6fbc921d892949d"},"title":"flat white","ingredients":[{"name":"espresso","amount":"1/3"},{"name":"micro-foam","amount":"2/3"}],"description":"Flat White originates from Australia and is becoming more popular around the world. It is easy to confuse this with the latte but the difference here is the use of microfoam instead of regular steamed milk. The microfoam is the steamed milk from the bottom of the pitcher used to steam the milk. This means there is a finer layer of froth on top and there are no air bubbles making the overall drink less texturised but giving a smooth milky feel.","variation":"Cappuccino is very similar but the flat white uses micro-foam instead. The latte is argued to be similar but the main difference between the Flat White and the Latte is its presentation. The flat white is served in a ceramic cup and some barista top a latte with extra froth.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243902/flat_white_rpfw7h.png"},{"_id":{"$oid":"595cbb55b6fbc921d892949e"},"title":"cortado","ingredients":[{"name":"espresso","amount":"1/2"},{"name":"steamed milk","amount":"1/2"}],"description":"Cortado is exactly half espresso and half steamed milk. The name cortado literally means \"cut\". This drink is served in a glass so you can see the milk layer separated from the espresso layer. In Chile for example, the barista first has milk at the bottom of the glass, pours an espresso shot next, then adds milk foam on the top so it floats giving the effect of the espresso being cut in between the two milk layers. In order to not have the espresso mixed with the milk, during pouring the barista uses a spoon to control the speed for a slow pour.","variation":"The cortado should always be served in a 150 to 200 ml (5 to 7 fl oz) glass. The milk has to be steamed milk in order for it to be called a cortado. Keep in mind that the cortado is very similar to its larger cousin, the Galao.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243901/cortado_dldjg5.png"},{"_id":{"$oid":"595cbd89b567bc22f4be5bdc"},"title":"galão","ingredients":[{"name":"espresso","amount":"1/4"},{"name":"steamed milk","amount":"3/4"}],"description":"The Galão originates from Portugal. The Galão is simply a cortado with more milk. It is very similar to a latte. Its ratio is 1:3 espresso to milk instead of 1:1 used in the cortado. In fact, it is so close to a latte that the only noticeable difference is the way it is presented, usually served in a tall glass.","variation":"Garoto - similar to Galão but the only difference is presentation. The garoto is served in a smaller china cup.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243901/gala%CC%83o_twoad0.png"},{"_id":{"$oid":"595cbd89b567bc22f4be5bdd"},"title":"breve","ingredients":[{"name":"espresso","amount":"1/3"},{"name":"half-and-half","amount":"2/3"}],"description":"This drink is exactly the same as a latte but instead uses steamed half-and-half instead of steamed milk. The half-and-half is generally a 50:50 mixture of milk and cream. The word \"breve\" is Italian for \"brief\".","variation":"Mocha breve - similar drink with chocolate syrup and is typically served with whipped cream.\n\nIced breve - same drink but served over ice.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243900/breve_dylrfl.png"},{"_id":{"$oid":"595cbd89b567bc22f4be5bde"},"title":"espresso con panna","ingredients":[{"name":"espresso","amount":"2/3"},{"name":"wipped cream","amount":"1/3"}],"description":"Single shot of espresso topped with whipped cream. Italian for \"espresso with cream\".","variation":"Café Vienne - alternative name in the USA.\n\nCafé Viennois - alternative name in the United Kingdom.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243902/espresso_con_panna_msmrof.png"},{"_id":{"$oid":"595cc0c63e733b248b7186bb"},"title":"café au lait","ingredients":[{"name":"brewed coffee","amount":"1/4"},{"name":"steamed milk","amount":"3/4"}],"description":"Similar to a Caffé Latte but is made with brewed coffee instead of espresso. The name is French for \"coffee with milk\". This drink is different from white coffee, since white coffee uses room temperature milk instead of steamed milk.","variation":"Caffé Misto - same drink but just another name for it. The term misto means mixed.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243900/cafe%CC%81_au_lait_wgp9ah.png"},{"_id":{"$oid":"595cc0c63e733b248b7186bc"},"title":"long black","ingredients":[{"name":"hot water","amount":"2/3"},{"name":"espresso","amount":"1/3"}],"description":"This drink is more popular in New Zealand and Australia but growing in popularity in the UK and other parts of the U.S. as well. In this drink, the bottom layer is hot water and a double shot of espresso is added on top. This is very similar to an americano but just reversed.\n\nThe main difference between the long black and americano (other than the order) is that the long black retains the espresso's crema and is less voluminous, resulting in a more strong flavor.","variation":"Caffé Lungo - the espresso used is made with more water passing through the coffee grounds. This results in less strong flavor.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243904/long_black_idt7yo.png"},{"_id":{"$oid":"595cc0c63e733b248b7186bd"},"title":"red eye","ingredients":[{"name":"espresso","amount":"1/3"},{"name":"drip coffee","amount":"2/3"}],"description":"Fortified coffee drink which has espresso combined with normal drip brew coffee. This drink has many different names. Red eye, black eye, and dead eye are all variations where drip coffee is added to one, two, or three shots of espresso respectively.\n\"Black eye\" refers to the circular black marking caused by pouring the shot of espresso on top of the cup of coffee with cream. The \"red eye\" refers to the scenario where a person needs to stay awake through the night from a flight from the West Coast to New York.","variation":"Red Eye, Black Eye, Dead Eye - drip coffee added to one, two, or three shots of espresso respectively\n\nLazy eye - decaffeinated coffee added to a shot of espresso.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243902/red_eye_anpbjn.png"},{"_id":{"$oid":"595cc0c63e733b248b7186be"},"title":"affogato","ingredients":[{"name":"espresso","amount":"1/4"},{"name":"gelato","amount":"3/4"}],"description":"Espresso with gelato or ice cream added on top. Affogato is Italian for \"drowned\". A popular way to make this drink is to first have the gelato or ice cream in the bottom of the cup then pour the amount of espresso you want over it. That way the espresso drizzles over the gelato and melting it to form the Affogato","variation":"Semifreddo - Italian for half cold, class of semi-frozen desserts typically ice cream with a shot of espresso.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243900/affagato_tyrwjy.png"},{"_id":{"$oid":"595cc0c63e733b248b7186bf"},"title":"corretto","ingredients":[{"name":"hot water","amount":"3/4"},{"name":"liquor","amount":"1/4"}],"description":"Espresso with a shot of liquor. The liquor used is most commonly either grappa or brandy. The word corretto is Italian for \"spiked\" or \"corrected\" as lovers of this drink believe this is the correct and proper way to enjoy espresso. :)","variation":"Irish Coffee - hot brewed coffee, Irish whiskey, and brown sugar all mixed then topped with thick cream. Sometimes whipped cream can be used instead.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243899/corretto_d58ssp.png"},{"_id":{"$oid":"595cc0c63e733b248b7186c0"},"title":"white coffee","ingredients":[{"name":"brewed coffee","amount":"2/3"},{"name":"milk","amount":"1/3"}],"description":"White coffee is a generic term refering to black brewed coffee added with any form of whitener like half-and-half.\n\nWhite coffee is different than a café au lait because white coffee uses room temperature milk or whitener, while café au lait uses heated or steamed milk.","variation":"Many variations exist because there are many different types of \"whiteners\" used. Adding sugar is also popular. Anytime you hear cofee with cream/sugar refers to this drink.","image":"http://res.cloudinary.com/aakashsigdel/image/upload/v1499243902/white_coffee_sdwfrg.png"}]
